//----------------------------------------------------------------------
// @filename ObjectBase.cpp
// @author: saito ko
// @explanation
// オブジェクトの基底クラス
//----------------------------------------------------------------------
#include "../../../Header/Object/Base/ObjectBase.h"
#include "../AppFrame/source/System/Header/Function/mymath.h"
//----------------------------------------------------------------------
// @brief コンストラクタ
// @param オブジェクトの名前
// @return 無し
//----------------------------------------------------------------------
ObjectBase::ObjectBase(const std::string& name){
	_name = name;
};
//----------------------------------------------------------------------
// @brief デストラクタ
// @return 無し
//----------------------------------------------------------------------
ObjectBase::~ObjectBase(){

};
//----------------------------------------------------------------------
// @brief 更新処理
// @return 成功したかどうか
//----------------------------------------------------------------------
bool ObjectBase::Update(){
	return true;
};
//----------------------------------------------------------------------
// @brief オブジェクトの更新後に行う処理
// @return 成功したか
//----------------------------------------------------------------------
bool ObjectBase::UpdateEnd(){
	return true;
};
//----------------------------------------------------------------------
// @brief 描画処理
// @return 成功したかどうか
//----------------------------------------------------------------------
bool ObjectBase::DebugDraw() {
	return true;
};